In [14]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([["A",1],["B",2],["C",3],["D",4]], columns = ["Col_A","Col_B"]) 
df

  Col_A  Col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [3]:
sort_list = ["C","D","B","A"]
s = pd.Series(range(len(sort_list)),index = sort_list)
s

C    0
D    1
B    2
A    3
dtype: int64

In [4]:
df.sort_values("Col_A", key = lambda x:x.map(s))

  Col_A  Col_B
2     C      3
3     D      4
1     B      2
0     A      1

In [5]:
new_column = ["P","Q","R","S"]
insert_position = 1

In [6]:
df.insert(insert_position, "Col_C", new_column)
df

  Col_A Col_C  Col_B
0     A     P      1
1     B     Q      2
2     C     R      3
3     D     S      4

In [7]:
# output_df = df.select_dtypes(include = dt_type)

In [9]:
df = pd.DataFrame([["A",1,True],["B",2,False],["C",3,False],["D",4,False]], columns = ["Col_A","Col_B","Col_C"]) 
df

  Col_A  Col_B  Col_C
0     A      1   True
1     B      2  False
2     C      3  False
3     D      4  False

In [10]:
dt_type = "bool"

In [11]:
output_df = df.select_dtypes(include = dt_type)

In [12]:
output_df

   Col_C
0   True
1  False
2  False
3  False

In [13]:
#  Count the number of Non-NaN cells for each column

In [16]:
df = pd.DataFrame([["A",np.NaN],[np.NaN,5],["A",np.NaN],["A",4]], columns = ["col_A","col_b"])
df

  col_A  col_b
0     A    NaN
1   NaN    5.0
2     A    NaN
3     A    4.0

In [17]:
df.count()

col_A    3
col_b    2
dtype: int64

In [18]:
# Split DataFrame into equal parts

In [20]:
df = pd.DataFrame([["A",1],["B",2],["C",3],["D",4]], columns = ["Col_A","Col_B"]) 
df

  Col_A  Col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [21]:
parts = 2
out_df1, out_df2 = np.split(df, parts)

In [22]:
out_df1

  Col_A  Col_B
0     A      1
1     B      2

In [23]:
out_df2

  Col_A  Col_B
2     C      3
3     D      4

In [25]:
# Reverse DataFrame row-wise or column-wise

In [26]:
col_reverse = df.loc[:, ::-1]
col_reverse

   Col_B Col_A
0      1     A
1      2     B
2      3     C
3      4     D

In [27]:
row_reverse = df.loc[::-1]

In [28]:
row_reverse

  Col_A  Col_B
3     D      4
2     C      3
1     B      2
0     A      1

In [29]:
# . Rearrange columns of a DataFrame

In [31]:
rearrange_order = [1,0]
putput_df = df.iloc[:, rearrange_order]

In [32]:
putput_df

   Col_B Col_A
0      1     A
1      2     B
2      3     C
3      4     D

In [33]:
# . Rearrange columns of a DataFrame

In [38]:
df.iloc[::3]

  Col_A  Col_B
0     A      1
3     D      4

In [51]:
insert_pos = 1
insert_row = ["p",5]

In [52]:
df.loc[insert_pos - 0.1] = insert_row

In [53]:
df = df.sort_index()

In [54]:
df

    Col_A  Col_B
0.0     A      1
0.9     p      5
1.0     B      2
1.5     p      5
2.0     C      3
2.5     p      5
2.9     p      5
3.0     D      4

In [ ]:
# Insert a row at an arbitrary position

In [55]:
insert_pos = 2
insert_row = ["p",5]

In [56]:
df.loc[insert_pos - 0.5] = insert_row

In [57]:
df

    Col_A  Col_B
0.0     A      1
0.9     p      5
1.0     B      2
1.5     p      5
2.0     C      3
2.5     p      5
2.9     p      5
3.0     D      4

In [61]:
df.loc[insert_pos - 0.1] = insert_row

In [62]:
df = df.sort_index()

In [67]:
df = df.reset_index(drop = True)

In [68]:
 df

   index Col_A  Col_B
0      0     A      1
1      1     p      5
2      2     p      5
3      3     B      2
4      4     p      5
5      5     C      3
6      6     p      5
7      7     p      5
8      8     D      4

In [69]:
#  Apply function to every cell of DataFrame

In [70]:
df = pd.DataFrame([[1,5],[2,6],[3,7],[4,8]], columns=["col_A","col_B"])
df

   col_A  col_B
0      1      5
1      2      6
2      3      7
3      4      8

In [75]:
def func(num):
    return num+1
df.applymap(func)

   col_A  col_B
0      2      6
1      3      7
2      4      8
3      5      9